{"inkVersion":20,"root":[[{"->":"idle"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"idle":["ev",{"VAR?":"level"},"/ev",["du","ev",1,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":"idle_1"},{"->":"idle.5"},null]}],[{"->":".^.b"},{"b":["pop","\n",{"->":"idle_1"},{"->":"idle.5"},null]}],"nop","\n",{"#f":1}],"idle_1":[["ev","str","^Interrogation","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"interrogation_1_checkpoint","var":true},"\n",{"#f":5}]}],{"#f":1}],"interrogation_1":["^DETECTIVE 1: Aaah, Eva! It is quite my surprise that I have caught you on my way out of the office. How are you?","\n","^EVA: I'm fine, Robert.","\n","^DETECTIVE 1: You're brash as always, dearest Eva. You know, I've just thought of the most perfect metaphor to describe you!","\n","^EVA: It's practically your thousanth metaphor at this point, but go ahead.","\n","^DETECTIVE 1: \"She's like the sandpaper in a construction zone; working hard but coarse through and through.\" I think it's much more accurate than my last, don't you think?","\n","^EVA: That is a simile.","\n","^DETECTIVE 1: No, it's a metaphor. A highly educated person such as myself would know that.","\n","^EVA: ...","\n","^DETECTIVE 1: But! I have not just come here for fun and games, dearest Eva. I have a key piece of intel I am eager to share with you!","\n","^DETECTIVE 1: Last night we received a call on the phone from a chef at a local bar. You know, one of those run down, dingy places here? That practically smells of rotten oil and grease?","\n","^EVA: What? Go on...","\n","^DETECTIVE 1: Well, to repeat what he said, *ahem* \"Ayeee know sumthun abut the one yer tryin' tooo catch, but I can't say nuthin' here. It's real important!\"","\n","^EVA: I'm sure he didn't sound like that, but go on.","\n","^DETECTIVE 1: Well, you know how those... ugh... people speak. If I did not know any better, I would assume they were drunk every time they spoke!","\n","^DETECTIVE 1: Regardless, they supposedly have key information about those murders we have been trying to solve. Hey, if they are good, maybe they will take your spot here in the force!","\n","^EVA: ...","\n","^DETECTIVE 1: We are going to go tomorrow afternoon at thirteen hundred hours. This investigation is your specialty, after all, so it is important that you be there.","\n","^EVA: I'll be there, Robert. And where exactly is 'there'?","\n","^DETECTIVE 1: Uncle John's Bar. I do have to leave, now. I have an appointment with a stunning young lady very soon. As the kids say nowadays, do not 'snap your cap' because I knew about this before you. I know you love your case but you just have to accept that you won't always live up to your father's reputation.","\n","^EVA: Hey, I can and am living up to his reputation! Ugh. See you tomorrow. Oh, and you said the man we are interviewing is a chef... correct?","\n","^DETECTIVE: You do crack me up! That is correct. Goodbye now. ",{"#":"name: DetectiveLeave"},"\n","^EVA: How on earth would a chef know about... wait... damn it.","\n","^EVA: He knew what would happen if he told anyone. I guess I'd better do something about this. ",{"#":"name: EvaLeave"},"\n",{"->":"end_interrogation"},{"#f":3}],"save_and_exit":[{"temp=":"address"},"ev",{"VAR?":"level"},"/ev",["du","ev",1,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n","ev",{"VAR?":"address"},"/ev",{"VAR=":"interrogation_1_checkpoint","re":true},{"->":".^.^.^.6"},null]}],"pop","nop","^ ",{"->":"end_interrogation"},"\n",{"#f":1}],"end_interrogation":[{"#":"name: FadeToBlack"},{"#":"end"},{"->":"idle"},{"#f":1}],"global decl":["ev",1,{"VAR=":"level"},{"^->":"interrogation_1"},{"VAR=":"interrogation_1_checkpoint"},"/ev","end",null],"#f":1}],"listDefs":{}}